/******/ (function() { // webpackBootstrap
var __webpack_exports__ = {};
/*!**************************!*\
  !*** ./src/js/script.js ***!
  \**************************/
//Мінімум

//Напиши всі можливі варіанти створення функцій.

// Створи функцію, яка буде виводити кількість переданих їй аргументів.

function func1() {
  console.log(arguments.length);
}
func1(1);
func1(1, 2);
func1(2, 3, 4, 5);

// Напиши функцію, яка приймає 2 числа і повертає :
// -1, якщо перше число менше, ніж друге;
// 1 - якщо перше число більше, ніж друге;
// 0 - якщо числа рівні.

function numReturn(x, y) {
  if (x < y) {
    console.log('-1');
  } else if (x > y) {
    console.log('1');
  } else {
    console.log('0');
  }
}
numReturn(100, 100);

// Напиши функцію, яка обчислює факторіал переданого їй числа.
function numFactorial(n) {}

// Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.
// Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.

// function func1() {
//     if(arguments.length == 2)
//     {
//         return arguments[0] * arguments[1];
//     } else if(arguments.length == 1)
//     {
//         return arguments[0] * arguments[0];
//     } else
//     {
//         //error
//     }
// }

// function func1(a, b) {
//     if(b == undefined)
//     {
//         return a * a;
//     } else{
//         return a * b;
//     }
// }

// Норма

// Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”. Досконале число - це число, яке дорівнює сумі всіх своїх дільників.
// Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими. Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим.
/******/ })()
;
//# sourceMappingURL=script.js.map