// Мінімум

// 1. Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.


// 2. Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).


// 3. Підрахуй суму всіх чисел в заданому користувачем діапазоні.


// 4. Запитай у користувача 2 числа і знайди найбільший спільний дільник.


// 5. Запитай у користувача число і виведи всі дільники цього числа.


// Норма

// 1. Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.


// 2. Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// 2.a від 200 до 300 - знижка буде 3%;
// 2.b від 300 до 500 - 5%;
// 2.c від 500 і вище - 7%.


// 3. Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.


// 4. Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.
