/******/ (function() { // webpackBootstrap
var __webpack_exports__ = {};
/*!**************************!*\
  !*** ./src/js/script.js ***!
  \**************************/
// Мінімум

// Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.
// const userAge = +prompt("Введите свой возраст");
// if (userAge >= 0 && userAge <= 11) {
//     console.log("Вы ребенок");
// } else if (userAge >= 12 && userAge <= 17) {
//     console.log("Вы подросток");
// } else if (userAge >= 18 && userAge <= 59) {
//     console.log("ВЫ взрослый");
// } else if (userAge >= 60) {
//     console.log("ВЫ персионер");
// } else {
//     console.log("Неверно введены данные");
// };

// Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
// const userNumber = +prompt("Введите число от 0 до 9");
// switch (userNumber) {
//     case 0:
//         console.log(")");
//         break;
//     case 1:
//         console.log("!");
//         break;
//     case 2:
//         console.log("@");
//         break;
//     case 3:
//         console.log("#");
//         break;
//     case 4:
//         console.log("$");
//         break;
//     case 5:
//         console.log("%");
//         break;
//     case 6:
//         console.log("^");
//         break;
//     case 7:
//         console.log("&");
//         break;
//     case 8:
//         console.log("*");
//         break;
//     default:
//         console.log("(");
//         break;
// };

// Підрахуй суму всіх чисел в заданому користувачем діапазоні.

// Запитай у користувача 2 числа і знайди найбільший спільний дільник.
// Запитай у користувача число і виведи всі дільники цього числа.
// Норма

// Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.
// Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%;
// від 300 до 500 - 5%;
// від 500 і вище - 7%.
// Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.
// Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.
// Максимум

// Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу
// діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?».
// Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50.
// Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N
//  (буде корисним почитати про алгоритм: "бінарний пошук").

// Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
// Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.
/******/ })()
;
//# sourceMappingURL=script.js.map